{"ibm-granite/granite-4.0-tiny-preview": {"architectures": ["GraniteMoeHybridForCausalLM"], "attention_bias": false, "attention_dropout": 0.0, "attention_multiplier": 0.0078125, "bos_token_id": 0, "embedding_multiplier": 12, "eos_token_id": 0, "hidden_act": "silu", "hidden_size": 1536, "init_method": "mup", "initializer_range": 0.1, "intermediate_size": 512, "layer_types": ["mamba", "mamba", "mamba", "mamba", "mamba", "attention", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "attention", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "attention", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "mamba", "attention", "mamba", "mamba", "mamba", "mamba"], "logits_scaling": 6, "logits_to_keep": 1, "mamba_chunk_size": 256, "mamba_conv_bias": true, "mamba_d_conv": 4, "mamba_d_head": 64, "mamba_d_state": 128, "mamba_expand": 2, "mamba_n_groups": 1, "mamba_n_heads": 48, "mamba_proj_bias": false, "max_position_embeddings": 131072, "model_type": "granitemoehybrid", "normalization_function": "rmsnorm", "num_attention_heads": 12, "num_experts_per_tok": 6, "num_hidden_layers": 40, "num_key_value_heads": 4, "num_local_experts": 62, "output_router_logits": false, "pad_token_id": 0, "position_embedding_type": "nope", "residual_multiplier": 0.22, "rms_norm_eps": 1e-05, "rope_scaling": null, "rope_theta": 10000, "router_aux_loss_coef": 0.0, "shared_intermediate_size": 1024, "tie_word_embeddings": true, "transformers_version": "4.51.0.dev0", "use_cache": true, "vocab_size": 49160}, "ibm-granite/granite-3.3-2b-instruct": {"architectures": ["GraniteForCausalLM"], "attention_bias": false, "attention_dropout": 0.0, "attention_multiplier": 0.015625, "bos_token_id": 0, "embedding_multiplier": 12.0, "eos_token_id": 0, "hidden_act": "silu", "hidden_size": 2048, "initializer_range": 0.02, "intermediate_size": 8192, "logits_scaling": 8.0, "max_position_embeddings": 131072, "mlp_bias": false, "model_type": "granite", "num_attention_heads": 32, "num_hidden_layers": 40, "num_key_value_heads": 8, "pad_token_id": 0, "residual_multiplier": 0.22, "rms_norm_eps": 1e-05, "rope_scaling": null, "rope_theta": 10000000.0, "tie_word_embeddings": true, "torch_dtype": "bfloat16", "transformers_version": "4.49.0", "use_cache": true, "vocab_size": 49159}, "ibm-granite/granite-3.3-8b-instruct": {"architectures": ["GraniteForCausalLM"], "attention_bias": false, "attention_dropout": 0.0, "attention_multiplier": 0.0078125, "bos_token_id": 0, "embedding_multiplier": 12.0, "eos_token_id": 0, "hidden_act": "silu", "hidden_size": 4096, "initializer_range": 0.02, "intermediate_size": 12800, "logits_scaling": 16.0, "max_position_embeddings": 131072, "mlp_bias": false, "model_type": "granite", "num_attention_heads": 32, "num_hidden_layers": 40, "num_key_value_heads": 8, "pad_token_id": 0, "residual_multiplier": 0.22, "rms_norm_eps": 1e-05, "rope_scaling": null, "rope_theta": 10000000.0, "tie_word_embeddings": true, "torch_dtype": "bfloat16", "transformers_version": "4.49.0", "use_cache": true, "vocab_size": 49159}, "ibm-granite/granite-3.2-2b-instruct": {"architectures": ["GraniteForCausalLM"], "attention_bias": false, "attention_dropout": 0.1, "attention_multiplier": 0.015625, "bos_token_id": 0, "embedding_multiplier": 12.0, "eos_token_id": 0, "hidden_act": "silu", "hidden_size": 2048, "initializer_range": 0.02, "intermediate_size": 8192, "logits_scaling": 8.0, "max_position_embeddings": 131072, "mlp_bias": false, "model_type": "granite", "num_attention_heads": 32, "num_hidden_layers": 40, "num_key_value_heads": 8, "pad_token_id": 0, "residual_multiplier": 0.22, "rms_norm_eps": 1e-05, "rope_scaling": null, "rope_theta": 5000000.0, "tie_word_embeddings": true, "torch_dtype": "bfloat16", "transformers_version": "4.47.0", "use_cache": true, "vocab_size": 49155}, "ibm-granite/granite-3.2-8b-instruct": {"architectures": ["GraniteForCausalLM"], "attention_bias": false, "attention_dropout": 0.1, "attention_multiplier": 0.0078125, "bos_token_id": 0, "embedding_multiplier": 12.0, "eos_token_id": 0, "hidden_act": "silu", "hidden_size": 4096, "initializer_range": 0.02, "intermediate_size": 12800, "logits_scaling": 16.0, "max_position_embeddings": 131072, "mlp_bias": false, "model_type": "granite", "num_attention_heads": 32, "num_hidden_layers": 40, "num_key_value_heads": 8, "pad_token_id": 0, "residual_multiplier": 0.22, "rms_norm_eps": 1e-05, "rope_scaling": null, "rope_theta": 10000000.0, "tie_word_embeddings": true, "torch_dtype": "bfloat16", "transformers_version": "4.47.0", "use_cache": true, "vocab_size": 49155}, "meta-llama/Llama-2-7b-hf": {"_name_or_path": "meta-llama/Llama-2-7b-hf", "architectures": ["LlamaForCausalLM"], "bos_token_id": 1, "eos_token_id": 2, "hidden_act": "silu", "hidden_size": 4096, "initializer_range": 0.02, "intermediate_size": 11008, "max_position_embeddings": 4096, "model_type": "llama", "num_attention_heads": 32, "num_hidden_layers": 32, "num_key_value_heads": 32, "pretraining_tp": 1, "rms_norm_eps": 1e-05, "rope_scaling": null, "tie_word_embeddings": false, "torch_dtype": "float16", "transformers_version": "4.31.0.dev0", "use_cache": true, "vocab_size": 32000}, "meta-llama/Llama-2-13b-hf": {"_name_or_path": "meta-llama/Llama-2-13b-hf", "architectures": ["LlamaForCausalLM"], "bos_token_id": 1, "eos_token_id": 2, "hidden_act": "silu", "hidden_size": 5120, "initializer_range": 0.02, "intermediate_size": 13824, "max_position_embeddings": 4096, "model_type": "llama", "num_attention_heads": 40, "num_hidden_layers": 40, "num_key_value_heads": 40, "pretraining_tp": 1, "rms_norm_eps": 1e-05, "rope_scaling": null, "tie_word_embeddings": false, "torch_dtype": "float16", "transformers_version": "4.32.0.dev0", "use_cache": true, "vocab_size": 32000}, "meta-llama/Llama-2-70b-hf": {"_name_or_path": "meta-llama/Llama-2-70b-hf", "architectures": ["LlamaForCausalLM"], "bos_token_id": 1, "eos_token_id": 2, "hidden_act": "silu", "hidden_size": 8192, "initializer_range": 0.02, "intermediate_size": 28672, "max_position_embeddings": 4096, "model_type": "llama", "num_attention_heads": 64, "num_hidden_layers": 80, "num_key_value_heads": 8, "pretraining_tp": 1, "rms_norm_eps": 1e-05, "rope_scaling": null, "tie_word_embeddings": false, "torch_dtype": "float16", "transformers_version": "4.32.0.dev0", "use_cache": true, "vocab_size": 32000}}